documents/images/graphio/bxdf/gltf_image_color3_color3_1_0.dot
digraph {
  rankdir = LR;
    NG_NG_gltf_image_color3_color3_1_0_scale_image [label= "multiply"];
    NG_NG_gltf_image_color3_color3_1_0_scale_image[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_scale_image ->     NG_NG_gltf_image_color3_color3_1_0_out;
    NG_NG_gltf_image_color3_color3_1_0_out [label= "out"];
    NG_NG_gltf_image_color3_color3_1_0_out[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_factorINT [label="factor"];
    NG_NG_gltf_image_color3_color3_1_0_factorINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_scale_image [label="multiply"];
    NG_NG_gltf_image_color3_color3_1_0_factorINT -> NG_NG_gltf_image_color3_color3_1_0_scale_image [label=".in1"];
    NG_NG_gltf_image_color3_color3_1_0_image [label= "image"];
    NG_NG_gltf_image_color3_color3_1_0_image[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_image ->     NG_NG_gltf_image_color3_color3_1_0_scale_image [label= "in2"];
    NG_NG_gltf_image_color3_color3_1_0_scale_image [label= "multiply"];
    NG_NG_gltf_image_color3_color3_1_0_scale_image[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_fileINT [label="file"];
    NG_NG_gltf_image_color3_color3_1_0_fileINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_image [label="image"];
    NG_NG_gltf_image_color3_color3_1_0_fileINT -> NG_NG_gltf_image_color3_color3_1_0_image [label=".file"];
    NG_NG_gltf_image_color3_color3_1_0_defaultINT [label="default"];
    NG_NG_gltf_image_color3_color3_1_0_defaultINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_image [label="image"];
    NG_NG_gltf_image_color3_color3_1_0_defaultINT -> NG_NG_gltf_image_color3_color3_1_0_image [label=".default"];
    NG_NG_gltf_image_color3_color3_1_0_uaddressmodeINT [label="uaddressmode"];
    NG_NG_gltf_image_color3_color3_1_0_uaddressmodeINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_image [label="image"];
    NG_NG_gltf_image_color3_color3_1_0_uaddressmodeINT -> NG_NG_gltf_image_color3_color3_1_0_image [label=".uaddressmode"];
    NG_NG_gltf_image_color3_color3_1_0_vaddressmodeINT [label="vaddressmode"];
    NG_NG_gltf_image_color3_color3_1_0_vaddressmodeINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_image [label="image"];
    NG_NG_gltf_image_color3_color3_1_0_vaddressmodeINT -> NG_NG_gltf_image_color3_color3_1_0_image [label=".vaddressmode"];
    NG_NG_gltf_image_color3_color3_1_0_filtertypeINT [label="filtertype"];
    NG_NG_gltf_image_color3_color3_1_0_filtertypeINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_image [label="image"];
    NG_NG_gltf_image_color3_color3_1_0_filtertypeINT -> NG_NG_gltf_image_color3_color3_1_0_image [label=".filtertype"];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label= "place2d"];
    NG_NG_gltf_image_color3_color3_1_0_place2d[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_place2d ->     NG_NG_gltf_image_color3_color3_1_0_image [label= "texcoord"];
    NG_NG_gltf_image_color3_color3_1_0_image [label= "image"];
    NG_NG_gltf_image_color3_color3_1_0_image[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_pivotINT [label="pivot"];
    NG_NG_gltf_image_color3_color3_1_0_pivotINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label="place2d"];
    NG_NG_gltf_image_color3_color3_1_0_pivotINT -> NG_NG_gltf_image_color3_color3_1_0_place2d [label=".pivot"];
    NG_NG_gltf_image_color3_color3_1_0_operationorderINT [label="operationorder"];
    NG_NG_gltf_image_color3_color3_1_0_operationorderINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label="place2d"];
    NG_NG_gltf_image_color3_color3_1_0_operationorderINT -> NG_NG_gltf_image_color3_color3_1_0_place2d [label=".operationorder"];
    NG_NG_gltf_image_color3_color3_1_0_texcoord1 [label= "texcoord"];
    NG_NG_gltf_image_color3_color3_1_0_texcoord1[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_texcoord1 ->     NG_NG_gltf_image_color3_color3_1_0_place2d [label= "texcoord"];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label= "place2d"];
    NG_NG_gltf_image_color3_color3_1_0_place2d[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_uvindexINT [label="uvindex"];
    NG_NG_gltf_image_color3_color3_1_0_uvindexINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_texcoord1 [label="texcoord"];
    NG_NG_gltf_image_color3_color3_1_0_uvindexINT -> NG_NG_gltf_image_color3_color3_1_0_texcoord1 [label=".index"];
    NG_NG_gltf_image_color3_color3_1_0_invert_scale [label= "divide"];
    NG_NG_gltf_image_color3_color3_1_0_invert_scale[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_invert_scale ->     NG_NG_gltf_image_color3_color3_1_0_place2d [label= "scale"];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label= "place2d"];
    NG_NG_gltf_image_color3_color3_1_0_place2d[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_scaleINT [label="scale"];
    NG_NG_gltf_image_color3_color3_1_0_scaleINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_invert_scale [label="divide"];
    NG_NG_gltf_image_color3_color3_1_0_scaleINT -> NG_NG_gltf_image_color3_color3_1_0_invert_scale [label=".in2"];
    NG_NG_gltf_image_color3_color3_1_0_negate_rotate [label= "multiply"];
    NG_NG_gltf_image_color3_color3_1_0_negate_rotate[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_negate_rotate ->     NG_NG_gltf_image_color3_color3_1_0_place2d [label= "rotate"];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label= "place2d"];
    NG_NG_gltf_image_color3_color3_1_0_place2d[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_rotateINT [label="rotate"];
    NG_NG_gltf_image_color3_color3_1_0_rotateINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_negate_rotate [label="multiply"];
    NG_NG_gltf_image_color3_color3_1_0_rotateINT -> NG_NG_gltf_image_color3_color3_1_0_negate_rotate [label=".in1"];
    NG_NG_gltf_image_color3_color3_1_0_negate_offset [label= "multiply"];
    NG_NG_gltf_image_color3_color3_1_0_negate_offset[shape = box];
    NG_NG_gltf_image_color3_color3_1_0_negate_offset ->     NG_NG_gltf_image_color3_color3_1_0_place2d [label= "offset"];
    NG_NG_gltf_image_color3_color3_1_0_place2d [label= "place2d"];
    NG_NG_gltf_image_color3_color3_1_0_place2d[shape = box]; 
    NG_NG_gltf_image_color3_color3_1_0_offsetINT [label="offset"];
    NG_NG_gltf_image_color3_color3_1_0_offsetINT [shape = ellipse];
    NG_NG_gltf_image_color3_color3_1_0_negate_offset [label="multiply"];
    NG_NG_gltf_image_color3_color3_1_0_offsetINT -> NG_NG_gltf_image_color3_color3_1_0_negate_offset [label=".in1"];
}
